In [1]:
import os
os.chdir("c:\\Users\\zhaobang\\OneDrive\\桌面\\NewKerosene")
import pandas as pd
from modules.kerosenePreprocess import Kerosene
import matplotlib.pyplot as plt
from modules import drawing as dr
from modules import DataDrop as DD
import numpy as np

In [7]:
df_cluster = pd.read_csv("./ClusteringProgram/ClusterData_cc/10_clusters.csv")
kerosene = Kerosene("./raw_data/2-supply-histories-with-sensor.csv")
# some special id to drop. Apporo dont need this
kerosene.normal_use.set_index("customer_id", inplace=True)
kerosene.normal_use.drop([666, 663, 650, 1086,725, 614, 775, 799, 1077, 1069, 1076], inplace=True)
kerosene.normal_use.reset_index(inplace=True)
for i in range(kerosene.normal_use.shape[0]):
    if kerosene.normal_use.loc[i, "volume"] == 0:
        kerosene.normal_use.drop(i, inplace=True)
kerosene.normal_use.reset_index(inplace=True)

normal_use_drop = DD.supply_data_drop(kerosene.normal_use.copy())
normal_use_drop["supplied_at"] = pd.to_datetime(normal_use_drop["supplied_at"], format="%Y-%m-%d %X")

c:\Users\zhaobang\AppData\Local\Programs\Python\Python38\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [8]:
clustering_data = normal_use_drop.copy()
item_counts = df_cluster["Cluster"].value_counts()

In [9]:
item_counts.index

Int64Index([2, 3, 4, 5, 6, 1, 7, 10, 8, 9], dtype='int64')

In [10]:
len(df_cluster)

97

In [11]:
cluster_df = {}
cluster_id = {}
for i in item_counts.index:
    cluster_df[i] = df_cluster[df_cluster["Cluster"] == i]
    cluster_id[i] = list(cluster_df[i]["ID"])

In [12]:
clustering_data.describe()

       customer_id       level_0         index  tank_type_id       volume
count  6851.000000   6851.000000   6851.000000   6851.000000  6851.000000
mean    834.947891   7212.909794  15816.710553      1.372792   241.614290
std     157.640793   3970.147996   8503.729829      0.778909   111.985315
min     601.000000     55.000000    430.000000      1.000000     9.100000
25%     717.000000   4143.500000   8717.500000      1.000000   167.800000
50%     808.000000   7167.000000  16349.000000      1.000000   218.900000
75%    1044.000000  10851.500000  23147.500000      1.000000   285.050000
max    1097.000000  13545.000000  28963.000000      3.000000  1173.300000

In [13]:
df_cluster_1 = clustering_data[clustering_data["customer_id"].isin(cluster_id[1])]
df_cluster_2 = clustering_data[clustering_data["customer_id"].isin(cluster_id[2])]
df_cluster_3 = clustering_data[clustering_data["customer_id"].isin(cluster_id[3])]
df_cluster_4 = clustering_data[clustering_data["customer_id"].isin(cluster_id[4])]
df_cluster_5 = clustering_data[clustering_data["customer_id"].isin(cluster_id[5])]
df_cluster_6 = clustering_data[clustering_data["customer_id"].isin(cluster_id[6])]
df_cluster_7 = clustering_data[clustering_data["customer_id"].isin(cluster_id[7])]
df_cluster_8 = clustering_data[clustering_data["customer_id"].isin(cluster_id[8])]
df_cluster_9 = clustering_data[clustering_data["customer_id"].isin(cluster_id[9])]
df_cluster_10 = clustering_data[clustering_data["customer_id"].isin(cluster_id[10])]

In [14]:
def cc_describe(column):
    cc_series = pd.Series([], name='courses')

In [15]:
df_cluster_1.describe()

       customer_id      level_0        index  tank_type_id      volume
count   179.000000   179.000000   179.000000         179.0  179.000000
mean    623.709497  3986.173184  8810.201117           1.0  230.110056
std      13.245498   220.411255   624.592275           0.0   62.326208
min     613.000000  3747.000000  8243.000000           1.0   83.400000
25%     613.000000  3799.500000  8295.500000           1.0  190.000000
50%     613.000000  3850.000000  8346.000000           1.0  226.300000
75%     640.000000  4241.500000  9564.500000           1.0  274.900000
max     640.000000  4293.000000  9616.000000           1.0  442.200000

In [17]:
df_cluster_2.describe()

       customer_id       level_0         index  tank_type_id       volume
count  2804.000000   2804.000000   2804.000000   2804.000000  2804.000000
mean    823.769615   7304.514979  15995.823823      1.380171   209.029815
std     169.907823   3939.909406   8476.211905      0.784877    72.085156
min     601.000000     55.000000    430.000000      1.000000    16.600000
25%     658.000000   4152.750000   8726.750000      1.000000   157.750000
50%     770.000000   6904.500000  16007.500000      1.000000   206.600000
75%    1013.000000  10455.250000  22293.250000      1.000000   255.500000
max    1097.000000  13545.000000  28963.000000      3.000000   499.300000

In [16]:
item_counts

2     67
3     13
4      5
5      3
6      2
1      2
7      2
10     1
8      1
9      1
Name: Cluster, dtype: int64

In [19]:
df_cc = pd.read_csv("./ClusteringProgram/ClusterData_cc/cc.csv")
df_cc_time = pd.read_csv("./ClusteringProgram/ClusterData_cc/cc_time.csv")

In [22]:
def cc_describe(id_list, df_cc):
    s = pd.Series([])
    for i in id_list:
        s = pd.concat([s, df_cc[str(i)]], ignore_index=True)
    return s

In [23]:
def cc_plot(id,df_cc_time, df_cc, limy = [0, 1]):
    x = []
    y = []
    for i in df_cc_time[str(id)]:
        if not np.isnan(i):
            x.append(str(int(i)))
    for j in df_cc[str(id)]:
        if not np.isnan(j):
            y.append(j)
    plt.scatter(x, y, color="#d62728", marker='s')
    plt.plot(x, y, color="#2ca02c")
    plt.ylabel("相関係数(気温と給油量)",fontsize=15, fontname="MS Gothic")
    plt.xlabel("シーズン", fontsize=15, fontname="MS Gothic")
    plt.ylim(limy)

In [24]:
plt.rcParams['figure.figsize'] = [10, 5]

In [26]:
df_cluster_2.head()

,customer_id,level_0,index,tank_type_id,supplied_at,volume,purpose
0,637,55,430,1,2016-11-07 06:53:00,302.7,NaN
1,637,56,431,1,2016-11-15 06:52:00,226.2,NaN
2,637,57,432,1,2016-11-21 05:38:00,187.3,NaN
3,637,58,433,1,2016-11-28 06:59:00,273.5,NaN
4,637,59,434,1,2016-12-05 07:07:00,222.0,NaN

In [27]:
cc_describe(df_cluster_2["customer_id"], df_cc).describe()

C:\Users\zhaobang\AppData\Local\Temp/ipykernel_17604/703776907.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series([])

count    11859.000000
mean         0.883084
std          0.089216
min          0.405635
25%          0.838412
50%          0.916742
75%          0.951191
max          1.000000
dtype: float64

In [28]:
df_cluster_2.head()

,customer_id,level_0,index,tank_type_id,supplied_at,volume,purpose
0,637,55,430,1,2016-11-07 06:53:00,302.7,NaN
1,637,56,431,1,2016-11-15 06:52:00,226.2,NaN
2,637,57,432,1,2016-11-21 05:38:00,187.3,NaN
3,637,58,433,1,2016-11-28 06:59:00,273.5,NaN
4,637,59,434,1,2016-12-05 07:07:00,222.0,NaN

In [31]:
def save_cluster(cluster, name):
    cluster.pop("level_0")
    cluster.pop("index")
    cluster.to_csv("./ClusteringProgram/Hierarchical_data_cc/" + name + ".csv", index=False)

In [32]:

save_cluster(df_cluster_2, "cluster_2")